MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GB204/mcu.h
extern volatile SPI2CON3BITS SPI2CON3bits __attribute__((__sfr__));

#define SPI2CON2H SPI2CON2H
extern volatile uint16_t SPI2CON2H __attribute__((__sfr__));
#define SPI2CON4 SPI2CON4
extern volatile uint16_t SPI2CON4 __attribute__((__sfr__));

#define SPI2 SPI2
extern volatile SPI SPI2 __attribute__((__sfr__));

#define SPI2STATL SPI2STATL
extern volatile uint16_t SPI2STATL __attribute__((__sfr__));
typedef struct tagSPI2STATLBITS {
  uint16_t SPIRBF:1;
  uint16_t SPITBF:1;
  uint16_t :1;
  uint16_t SPITBE:1;
  uint16_t :1;
  uint16_t SPIRBE:1;
  uint16_t SPIROV:1;
  uint16_t SRMT:1;
  uint16_t SPITUR:1;
  uint16_t :2;
  uint16_t SPIBUSY:1;
  uint16_t FRMERR:1;
} SPI2STATLBITS;
extern volatile SPI2STATLBITS SPI2STATLbits __attribute__((__sfr__));


#define SPI2 SPI2
extern volatile SPI SPI2 __attribute__((__sfr__));

#define SPI2STATH SPI2STATH
extern volatile uint16_t SPI2STATH __attribute__((__sfr__));
__extension__ typedef struct tagSPI2STATHBITS {
  union {
    struct {
      uint16_t TXELM:6;
      uint16_t :2;
      uint16_t RXELM:6;
    };
    struct {
      uint16_t TXELM0:1;
      uint16_t TXELM1:1;
      uint16_t TXELM2:1;
      uint16_t TXELM3:1;
      uint16_t TXELM4:1;
      uint16_t TXELM5:1;
      uint16_t :2;
      uint16_t RXELM0:1;
      uint16_t RXELM1:1;
      uint16_t RXELM2:1;
      uint16_t RXELM3:1;
      uint16_t RXELM4:1;
      uint16_t RXELM5:1;
    };
  };
} SPI2STATHBITS;
extern volatile SPI2STATHBITS SPI2STATHbits __attribute__((__sfr__));

#define SPI2BUFL SPI2BUFL
extern volatile uint16_t SPI2BUFL __attribute__((__sfr__));
__extension__ typedef struct tagSPI2BUFLBITS {
  union {
    struct {
      uint16_t SPI2BUFL:16;
    };
    struct {
      uint16_t DATA:16;
    };
  };
} SPI2BUFLBITS;
extern volatile SPI2BUFLBITS SPI2BUFLbits __attribute__((__sfr__));

#define SPI2BUFH SPI2BUFH
extern volatile uint16_t SPI2BUFH __attribute__((__sfr__));
__extension__ typedef struct tagSPI2BUFHBITS {
  union {
    struct {
      uint16_t SPI2BUFH:16;
    };
    struct {
      uint16_t DATA:16;
    };
  };
} SPI2BUFHBITS;
extern volatile SPI2BUFHBITS SPI2BUFHbits __attribute__((__sfr__));

#define SPI2BRGL SPI2BRGL
extern volatile uint16_t SPI2BRGL __attribute__((__sfr__));
__extension__ typedef struct tagSPI2BRGLBITS {
  union {
    struct {
      uint16_t SPI2BRGL:13;
    };
    struct {
      uint16_t BRG:13;
    };
  };
} SPI2BRGLBITS;
extern volatile SPI2BRGLBITS SPI2BRGLbits __attribute__((__sfr__));

#define SPI2BRGH SPI2BRGH
extern volatile uint16_t SPI2BRGH __attribute__((__sfr__));
#define SPI2IMSK1 SPI2IMSK1
extern volatile uint16_t SPI2IMSK1 __attribute__((__sfr__));
typedef struct tagSPI2IMSK1BITS {
  uint16_t SPIRBFEN:1;
  uint16_t SPITBFEN:1;
  uint16_t :1;
  uint16_t SPITBEN:1;
  uint16_t :1;
  uint16_t SPIRBEN:1;
  uint16_t SPIROVEN:1;
  uint16_t SRMTEN:1;
  uint16_t SPITUREN:1;
  uint16_t :2;
  uint16_t BUSYEN:1;
  uint16_t FRMERREN:1;
} SPI2IMSK1BITS;
extern volatile SPI2IMSK1BITS SPI2IMSK1bits __attribute__((__sfr__));

#define SPI2IMSKL SPI2IMSKL
extern volatile uint16_t SPI2IMSKL __attribute__((__sfr__));
typedef struct tagSPI2IMSKLBITS {
  uint16_t SPIRBFEN:1;
  uint16_t SPITBFEN:1;
  uint16_t :1;
  uint16_t SPITBEN:1;
  uint16_t :1;
  uint16_t SPIRBEN:1;
  uint16_t SPIROVEN:1;
  uint16_t SRMTEN:1;
  uint16_t SPITUREN:1;
  uint16_t :2;
  uint16_t BUSYEN:1;
  uint16_t FRMERREN:1;
} SPI2IMSKLBITS;
extern volatile SPI2IMSKLBITS SPI2IMSKLbits __attribute__((__sfr__));

#define SPI2IMSK2 SPI2IMSK2
extern volatile uint16_t SPI2IMSK2 __attribute__((__sfr__));
__extension__ typedef struct tagSPI2IMSK2BITS {
  union {
    struct {
      uint16_t TXMSK:6;
      uint16_t :1;
      uint16_t TXWIEN:1;
      uint16_t RXMSK:6;
      uint16_t :1;
      uint16_t RXWIEN:1;
    };
    struct {
      uint16_t TXMSK0:1;
      uint16_t TXMSK1:1;
      uint16_t TXMSK2:1;
      uint16_t TXMSK3:1;
      uint16_t TXMSK4:1;
      uint16_t TXMSK5:1;
      uint16_t :2;
      uint16_t RXMSK0:1;
      uint16_t RXMSK1:1;
      uint16_t RXMSK2:1;
      uint16_t RXMSK3:1;
      uint16_t RXMSK4:1;
      uint16_t RXMSK5:1;
    };
  };
} SPI2IMSK2BITS;
extern volatile SPI2IMSK2BITS SPI2IMSK2bits __attribute__((__sfr__));

#define SPI2IMSKH SPI2IMSKH
extern volatile uint16_t SPI2IMSKH __attribute__((__sfr__));
__extension__ typedef struct tagSPI2IMSKHBITS {
  union {
    struct {
      uint16_t TXMSK:6;
      uint16_t :1;
      uint16_t TXWIEN:1;
      uint16_t RXMSK:6;
      uint16_t :1;
      uint16_t RXWIEN:1;
    };
    struct {
      uint16_t TXMSK0:1;
      uint16_t TXMSK1:1;
      uint16_t TXMSK2:1;
      uint16_t TXMSK3:1;
      uint16_t TXMSK4:1;
      uint16_t TXMSK5:1;
      uint16_t :2;
      uint16_t RXMSK0:1;
      uint16_t RXMSK1:1;
      uint16_t RXMSK2:1;
      uint16_t RXMSK3:1;
      uint16_t RXMSK4:1;
      uint16_t RXMSK5:1;
    };
  };
} SPI2IMSKHBITS;
extern volatile SPI2IMSKHBITS SPI2IMSKHbits __attribute__((__sfr__));

#define SPI2URDTL SPI2URDTL
extern volatile uint16_t SPI2URDTL __attribute__((__sfr__));
__extension__ typedef struct tagSPI2URDTLBITS {
  union {
    struct {
      uint16_t SPI2URDTL:16;
    };
    struct {
      uint16_t URDATA:16;
    };
  };
} SPI2URDTLBITS;
extern volatile SPI2URDTLBITS SPI2URDTLbits __attribute__((__sfr__));

#define SPI2URDTH SPI2URDTH
extern volatile uint16_t SPI2URDTH __attribute__((__sfr__));
__extension__ typedef struct tagSPI2URDTHBITS {
  union {
    struct {
      uint16_t SPI2URDTH:16;
    };
    struct {
      uint16_t URDATA:16;
    };
  };
} SPI2URDTHBITS;
extern volatile SPI2URDTHBITS SPI2URDTHbits __attribute__((__sfr__));

#define SPI3CON1 SPI3CON1
extern volatile uint16_t SPI3CON1 __attribute__((__sfr__));
__extension__ typedef struct tagSPI3CON1BITS {
  union {
    struct {
      uint16_t ENHBUF:1;
      uint16_t SPIFE:1;
      uint16_t MCLKEN:1;
      uint16_t DISSCK:1;
      uint16_t DISSDI:1;
      uint16_t MSTEN:1;
      uint16_t CKP:1;
      uint16_t SSEN:1;
      uint16_t CKE:1;
      uint16_t SMP:1;
      uint16_t MODE16:1;
      uint16_t MODE32:1;
      uint16_t DISSDO:1;
      uint16_t SPISIDL:1;
      uint16_t :1;
      uint16_t SPIEN:1;
    };
    struct {
      uint16_t :10;
      uint16_t MODE:2;
    };
  };
} SPI3CON1BITS;
extern volatile SPI3CON1BITS SPI3CON1bits __attribute__((__sfr__));

#define SPI3CON1L SPI3CON1L
extern volatile uint16_t SPI3CON1L __attribute__((__sfr__));
__extension__ typedef struct tagSPI3CON1LBITS {
  union {
    struct {
      uint16_t ENHBUF:1;
      uint16_t SPIFE:1;
      uint16_t MCLKEN:1;
      uint16_t DISSCK:1;
      uint16_t DISSDI:1;
      uint16_t MSTEN:1;
      uint16_t CKP:1;
      uint16_t SSEN:1;
      uint16_t CKE:1;
      uint16_t SMP:1;
      uint16_t MODE16:1;
      uint16_t MODE32:1;
      uint16_t DISSDO:1;
      uint16_t SPISIDL:1;
      uint16_t :1;
      uint16_t SPIEN:1;
    };
    struct {
      uint16_t :10;
      uint16_t MODE:2;
    };
  };
} SPI3CON1LBITS;
extern volatile SPI3CON1LBITS SPI3CON1Lbits __attribute__((__sfr__));

#define SPI3CON1H SPI3CON1H
extern volatile uint16_t SPI3CON1H __attribute__((__sfr__));
__extension__ typedef struct tagSPI3CON1HBITS {
  union {
    struct {
      uint16_t FRMCNT:3;
      uint16_t FRMSYPW:1;
      uint16_t MSSEN:1;
      uint16_t FRMPOL:1;
      uint16_t FRMSYNC:1;
      uint16_t FRMEN:1;
      uint16_t AUDMOD:2;
      uint16_t URDTEN:1;
      uint16_t AUDMONO:1;
      uint16_t IGNTUR:1;
      uint16_t IGNROV:1;
      uint16_t SPISGNEXT:1;
      uint16_t AUDEN:1;
    };
    struct {
      uint16_t FRMCNT0:1;
      uint16_t FRMCNT1:1;
      uint16_t FRMCNT2:1;
      uint16_t :5;
      uint16_t AUDMOD0:1;
      uint16_t AUDMOD1:1;
    };
  };
} SPI3CON1HBITS;
extern volatile SPI3CON1HBITS SPI3CON1Hbits __attribute__((__sfr__));

