MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GB204/mcu.h
#define SPI3CON2 SPI3CON2
extern volatile uint16_t SPI3CON2 __attribute__((__sfr__));
__extension__ typedef struct tagSPI3CON2BITS {
  union {
    struct {
      uint16_t FRMCNT:3;
      uint16_t FRMSYPW:1;
      uint16_t MSSEN:1;
      uint16_t FRMPOL:1;
      uint16_t FRMSYNC:1;
      uint16_t FRMEN:1;
      uint16_t AUDMOD:2;
      uint16_t URDTEN:1;
      uint16_t AUDMONO:1;
      uint16_t IGNTUR:1;
      uint16_t IGNROV:1;
      uint16_t SPISGNEXT:1;
      uint16_t AUDEN:1;
    };
    struct {
      uint16_t FRMCNT0:1;
      uint16_t FRMCNT1:1;
      uint16_t FRMCNT2:1;
      uint16_t :5;
      uint16_t AUDMOD0:1;
      uint16_t AUDMOD1:1;
    };
  };
} SPI3CON2BITS;
extern volatile SPI3CON2BITS SPI3CON2bits __attribute__((__sfr__));

#define SPI3CON2L SPI3CON2L
extern volatile uint16_t SPI3CON2L __attribute__((__sfr__));
typedef struct tagSPI3CON2LBITS {
  uint16_t WLENGTH:5;
} SPI3CON2LBITS;
extern volatile SPI3CON2LBITS SPI3CON2Lbits __attribute__((__sfr__));

#define SPI3CON3 SPI3CON3
extern volatile uint16_t SPI3CON3 __attribute__((__sfr__));
typedef struct tagSPI3CON3BITS {
  uint16_t WLENGTH:5;
} SPI3CON3BITS;
extern volatile SPI3CON3BITS SPI3CON3bits __attribute__((__sfr__));

#define SPI3CON2H SPI3CON2H
extern volatile uint16_t SPI3CON2H __attribute__((__sfr__));
#define SPI3CON4 SPI3CON4
extern volatile uint16_t SPI3CON4 __attribute__((__sfr__));

#define SPI3 SPI3
extern volatile SPI SPI3 __attribute__((__sfr__));

#define SPI3STATL SPI3STATL
extern volatile uint16_t SPI3STATL __attribute__((__sfr__));
typedef struct tagSPI3STATLBITS {
  uint16_t SPIRBF:1;
  uint16_t SPITBF:1;
  uint16_t :1;
  uint16_t SPITBE:1;
  uint16_t :1;
  uint16_t SPIRBE:1;
  uint16_t SPIROV:1;
  uint16_t SRMT:1;
  uint16_t SPITUR:1;
  uint16_t :2;
  uint16_t SPIBUSY:1;
  uint16_t FRMERR:1;
} SPI3STATLBITS;
extern volatile SPI3STATLBITS SPI3STATLbits __attribute__((__sfr__));


#define SPI3 SPI3
extern volatile SPI SPI3 __attribute__((__sfr__));

#define SPI3STATH SPI3STATH
extern volatile uint16_t SPI3STATH __attribute__((__sfr__));
__extension__ typedef struct tagSPI3STATHBITS {
  union {
    struct {
      uint16_t TXELM:6;
      uint16_t :2;
      uint16_t RXELM:6;
    };
    struct {
      uint16_t TXELM0:1;
      uint16_t TXELM1:1;
      uint16_t TXELM2:1;
      uint16_t TXELM3:1;
      uint16_t TXELM4:1;
      uint16_t TXELM5:1;
      uint16_t :2;
      uint16_t RXELM0:1;
      uint16_t RXELM1:1;
      uint16_t RXELM2:1;
      uint16_t RXELM3:1;
      uint16_t RXELM4:1;
      uint16_t RXELM5:1;
    };
  };
} SPI3STATHBITS;
extern volatile SPI3STATHBITS SPI3STATHbits __attribute__((__sfr__));

#define SPI3BUFL SPI3BUFL
extern volatile uint16_t SPI3BUFL __attribute__((__sfr__));
__extension__ typedef struct tagSPI3BUFLBITS {
  union {
    struct {
      uint16_t SPI3BUFL:16;
    };
    struct {
      uint16_t DATA:16;
    };
  };
} SPI3BUFLBITS;
extern volatile SPI3BUFLBITS SPI3BUFLbits __attribute__((__sfr__));

#define SPI3BUFH SPI3BUFH
extern volatile uint16_t SPI3BUFH __attribute__((__sfr__));
__extension__ typedef struct tagSPI3BUFHBITS {
  union {
    struct {
      uint16_t SPI3BUFH:16;
    };
    struct {
      uint16_t DATA:16;
    };
  };
} SPI3BUFHBITS;
extern volatile SPI3BUFHBITS SPI3BUFHbits __attribute__((__sfr__));

#define SPI3BRGL SPI3BRGL
extern volatile uint16_t SPI3BRGL __attribute__((__sfr__));
__extension__ typedef struct tagSPI3BRGLBITS {
  union {
    struct {
      uint16_t SPI3BRGL:13;
    };
    struct {
      uint16_t BRG:13;
    };
  };
} SPI3BRGLBITS;
extern volatile SPI3BRGLBITS SPI3BRGLbits __attribute__((__sfr__));

#define SPI3BRGH SPI3BRGH
extern volatile uint16_t SPI3BRGH __attribute__((__sfr__));
#define SPI3IMSK1 SPI3IMSK1
extern volatile uint16_t SPI3IMSK1 __attribute__((__sfr__));
typedef struct tagSPI3IMSK1BITS {
  uint16_t SPIRBFEN:1;
  uint16_t SPITBFEN:1;
  uint16_t :1;
  uint16_t SPITBEN:1;
  uint16_t :1;
  uint16_t SPIRBEN:1;
  uint16_t SPIROVEN:1;
  uint16_t SRMTEN:1;
  uint16_t SPITUREN:1;
  uint16_t :2;
  uint16_t BUSYEN:1;
  uint16_t FRMERREN:1;
} SPI3IMSK1BITS;
extern volatile SPI3IMSK1BITS SPI3IMSK1bits __attribute__((__sfr__));

#define SPI3IMSKL SPI3IMSKL
extern volatile uint16_t SPI3IMSKL __attribute__((__sfr__));
typedef struct tagSPI3IMSKLBITS {
  uint16_t SPIRBFEN:1;
  uint16_t SPITBFEN:1;
  uint16_t :1;
  uint16_t SPITBEN:1;
  uint16_t :1;
  uint16_t SPIRBEN:1;
  uint16_t SPIROVEN:1;
  uint16_t SRMTEN:1;
  uint16_t SPITUREN:1;
  uint16_t :2;
  uint16_t BUSYEN:1;
  uint16_t FRMERREN:1;
} SPI3IMSKLBITS;
extern volatile SPI3IMSKLBITS SPI3IMSKLbits __attribute__((__sfr__));

#define SPI3IMSK2 SPI3IMSK2
extern volatile uint16_t SPI3IMSK2 __attribute__((__sfr__));
__extension__ typedef struct tagSPI3IMSK2BITS {
  union {
    struct {
      uint16_t TXMSK:6;
      uint16_t :1;
      uint16_t TXWIEN:1;
      uint16_t RXMSK:6;
      uint16_t :1;
      uint16_t RXWIEN:1;
    };
    struct {
      uint16_t TXMSK0:1;
      uint16_t TXMSK1:1;
      uint16_t TXMSK2:1;
      uint16_t TXMSK3:1;
      uint16_t TXMSK4:1;
      uint16_t TXMSK5:1;
      uint16_t :2;
      uint16_t RXMSK0:1;
      uint16_t RXMSK1:1;
      uint16_t RXMSK2:1;
      uint16_t RXMSK3:1;
      uint16_t RXMSK4:1;
      uint16_t RXMSK5:1;
    };
  };
} SPI3IMSK2BITS;
extern volatile SPI3IMSK2BITS SPI3IMSK2bits __attribute__((__sfr__));

#define SPI3IMSKH SPI3IMSKH
extern volatile uint16_t SPI3IMSKH __attribute__((__sfr__));
__extension__ typedef struct tagSPI3IMSKHBITS {
  union {
    struct {
      uint16_t TXMSK:6;
      uint16_t :1;
      uint16_t TXWIEN:1;
      uint16_t RXMSK:6;
      uint16_t :1;
      uint16_t RXWIEN:1;
    };
    struct {
      uint16_t TXMSK0:1;
      uint16_t TXMSK1:1;
      uint16_t TXMSK2:1;
      uint16_t TXMSK3:1;
      uint16_t TXMSK4:1;
      uint16_t TXMSK5:1;
      uint16_t :2;
      uint16_t RXMSK0:1;
      uint16_t RXMSK1:1;
      uint16_t RXMSK2:1;
      uint16_t RXMSK3:1;
      uint16_t RXMSK4:1;
      uint16_t RXMSK5:1;
    };
  };
} SPI3IMSKHBITS;
